package com.biz.hello;

public class VarString_01 {

	// 시작점, 진입점 method
	// Run(Ctrl F11)실행했을 때 제일먼저 작동되는 (execute) 코드부분
	public static void main(String[] args) {
		
		// integer, 정수형 변수 선언
		// 정수값(숫자값)을 저장하기 위한 공간 선언
		// 정수값 : 정수리터럴
		int num1 = 10;
		
		// 문자형, character형 변수선언
		// 문자 : ''(SQ)마크로 묶여있는 문자 리터럴을 저장하기 위한 공간 선언
		char char1 = 'A';
		char char2 = '가';
		
		// 문자열형 변수 선언, string 형
		// 문자들이 나열된 형태!
	    // 문자열 : ""(DQ)마크로 묶여있는 문자열 리터럴을 저장하기 위한 공간 선언
		// String은 클래스형 키워드
		String str1 = "대한민국";
		
		// 일반적인 프로그래밍 언어에서는 
		// 문자(영문, 한글1글자)를 저장하는 방식은 모두 가능하다
		// 하지만 문자열( 2글자 이상의 문자들이 묶여있는)은
		// 프로그래밍 언어마다 다소 다른 방식으로 취급한다
		
		// 전통적인 C언어 환경에서는 문자열을 취급하는 데
		// 상당히 어려운 방법을 사용했었다
		// 자바는 설계당시에 문자열을 취급하는 방법이 없었는데 
		// String 이라는 특별한 클래스형 키워드를 만들어서
		// 매우 쉽게 문자열을 취급할 수 있도록 하였다.
		
		// 자바는 생산성( 얼마나 개발을 빠르고 쉽게, 오류가 없이)에
		// 중점을 두고 탄생한 언어다 보니 원래 설계에 없던 기능들을 매우 쉽게 추가가능
		// 이러한 철학에 바탕을 두고 탄생한 기능이 String형 값 취급 방법이다
				
		
	}
}
